rost0031/STM32491_CPLR/Firmware/Bootloader/src/app/CommMgr.c
            /* Append payload msg if needed */
            switch( me->msgPayloadName ) {
                case _CBStatusPayloadMsg:
                    evt->dataLen = CBStatusPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.statusPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBVersionPayloadMsg:
                    DBG_printf("Sending version payload\n");
                    evt->dataLen = CBVersionPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.versionPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBBootModePayloadMsg:
                    DBG_printf("Sending bootMode payload\n");
                    evt->dataLen = CBBootModePayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.bootmodePayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBFlashMetaPayloadMsg:
                    DBG_printf("Sending FlashMeta payload\n");
                    evt->dataLen = CBFlashMetaPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.flashMetaPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBFlashDataPayloadMsg:
                    DBG_printf("Sending FlashData payload\n");
                    evt->dataLen = CBFlashDataPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.flashDataPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBNoMsg:
                    WRN_printf("Not sending payload as part of Done msg.\n");
                    break;
                default:
                    WRN_printf("Unknown payload detected %d, this is probably an error\n",
                        me->msgPayloadName
                    );
                    break;
            }

            /* Send the Done msg buffer to the client */
            me->errorCode = Comm_sendToClient( evt );
            if ( ERR_NONE != me->errorCode ) {
                WRN_printf("Possible error sending Done, attempting to continue. Error: 0x%08x\n", me->errorCode);
            }

            if ( ERR_NONE != me->errorCode ) {
                WRN_printf("Send Done msg with status: 0x%08x\n", me->errorCode);
            }
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::COMM_MGR_TIMEOUT} */
        case COMM_MGR_TIMEOUT_SIG: {
            ERR_printf("COMM_MGR_TIMEOUT trying to process %d basic msg, error: 0x%08x\n",
                me->basicMsg._msgName, me->errorCode);
            status_ = Q_TRAN(&CommMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&CommMgr_Active);
            break;
        }
    }
    return status_;
}

/**
 * @brief	State that ensures the system stays in the Busy state while processing.
 * This state just self-posts an event to start the msg processing. Its primary
 * reason for existance is to make sure that the state machine ends up inside the
 * busy state for proper error handling (if any occur).
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::CommMgr::SM::Active::Busy::ValidateMsg} ...........................*/
static QState CommMgr_ValidateMsg(CommMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg} */
        case Q_ENTRY_SIG: {
            QTimeEvt_rearm(                                       /* Re-arm timer on entry */
                &me->commOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_COMM_MSG_VALIDATE_MSG_OP )
            );

            /* Post to self to leave the state and continue processing the rest of the msg */
            QEvt *evt = Q_NEW(QEvt, MSG_PROCESS_SIG);
            QACTIVE_POST(AO_CommMgr, (QEvt *)(evt), AO_CommMgr);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->commOpTimerEvt);                  /* Disarm timer on exit */
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS} */
        case MSG_PROCESS_SIG: {
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[GetBootMode?]} */
            if (_CBGetBootModeMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_CBGetBootModeMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _CBBootModePayloadMsg;

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.bootmodePayload._errorCode = me->errorCode;
                me->payloadMsgUnion.bootmodePayload._bootMode  = _CB_Bootloader; // This is the bootloader
                DBG_printf("Setting bootMode payload with bootmode: %d\n", me->payloadMsgUnion.bootmodePayload._bootMode);
                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[SetBootMode?]} */
            else if (_CBSetBootModeMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_CBSetBootModeMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _CBStatusPayloadMsg;

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;
                DBG_printf("Setting status payload with error code: %d\n", me->payloadMsgUnion.statusPayload._errorCode);
                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[Flash?]} */
            else if (_CBFlashMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

