rost0031/STM32491_CPLR/Firmware/Bootloader/src/app/CommMgr.c
                /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[Flash?]::[FlashMetaPayloa~} */
                if (_CBFlashMetaPayloadMsg == me->msgPayloadName) {
                    /* The flash meta payload is the start of the FW update.  The meta payload contains
                     * all the information about the coming fw data.  We need to store this so it can be
                     * used to keep track of the FW flash process. */

                    /* 1. Create a FWMetaEvt and send it along to FlashMgr AO to prep the flash */
                    FWMetaEvt *evt = Q_NEW(FWMetaEvt, FLASH_OP_START_SIG);
                    evt->imageCRC  = me->payloadMsgUnion.flashMetaPayload._imageCrc;
                    evt->imageMaj  = me->payloadMsgUnion.flashMetaPayload._imageMaj;
                    evt->imageMin  = me->payloadMsgUnion.flashMetaPayload._imageMin;
                    evt->imageSize = me->payloadMsgUnion.flashMetaPayload._imageSize;
                    evt->imageType = me->payloadMsgUnion.flashMetaPayload._imageType;
                    evt->imageNumPackets = me->payloadMsgUnion.flashMetaPayload._imageNumPackets;

                    evt->imageDatetimeLen = me->payloadMsgUnion.flashMetaPayload._imageDatetime_len;
                    MEMCPY(
                        evt->imageDatetime,
                        me->payloadMsgUnion.flashMetaPayload._imageDatetime,
                        evt->imageDatetimeLen
                    );
                    QACTIVE_POST(AO_FlashMgr, (QEvt *)(evt), AO_CommMgr);

                    /* Compose Done response.  We can re-use the current structure and it will be used by
                     * the exit action of the parent state to send the msg.  Here, we only set up fields
                     * that are specific to this response. We can also destructively change the payload
                     * name since we are sending a response right after this. */
                    me->msgPayloadName = _CBStatusPayloadMsg;

                    /* Don't change the basicMsg name since it should be the same in all cases. */
                    me->basicMsg._msgPayload = me->msgPayloadName;
                    status_ = Q_TRAN(&CommMgr_WaitForRespFromFlashMgr);
                }
                /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[Flash?]::[FlashDataPayloa~} */
                else if (_CBFlashDataPayloadMsg == me->msgPayloadName) {
                    /* The flash data payload is used to transfer the FW data packets to FlashMgr AO. */

                    /* 1. Create a FWMetaEvt and send it along to FlashMgr AO to prep the flash */
                    FWDataEvt *evt = Q_NEW(FWDataEvt, FLASH_DATA_SIG);
                    evt->dataCRC  = me->payloadMsgUnion.flashDataPayload._dataCrc;
                    evt->dataLen  = me->payloadMsgUnion.flashDataPayload._dataBuf_len;
                    evt->seqCurr  = me->payloadMsgUnion.flashDataPayload._seqCurr;
                    MEMCPY(
                        evt->dataBuf,
                        me->payloadMsgUnion.flashDataPayload._dataBuf,
                        evt->dataLen
                    );
                    QACTIVE_POST(AO_FlashMgr, (QEvt *)(evt), AO_CommMgr);

                    /* Compose Done response.  We can re-use the current structure and it will be used by
                     * the exit action of the parent state to send the msg.  Here, we only set up fields
                     * that are specific to this response. We can also destructively change the payload
                     * name since we are sending a response right after this. */
                    me->msgPayloadName = _CBStatusPayloadMsg;

                    /* Don't change the basicMsg name since it should be the same in all cases. */
                    me->basicMsg._msgPayload = me->msgPayloadName;
                    status_ = Q_TRAN(&CommMgr_WaitForRespFromFlashMgr);
                }
                /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[Flash?]::[else]} */
                else {
                    me->errorCode = ERR_MSG_UNEXPECTED_PAYLOAD;
                    WRN_printf("Unexpected Flash payload %d for FlashMsg. Error: 0x%08x\n",
                        me->msgPayloadName, me->errorCode);
                    status_ = Q_TRAN(&CommMgr_Idle);
                }
            }
            /* ${AOs::CommMgr::SM::Active::Busy::ValidateMsg::MSG_PROCESS::[else]} */
            else {
                me->errorCode = ERR_MSG_UNKNOWN_BASIC;
                ERR_printf(
                    "Unknown msg (%d) with msgId=%d. Sending back error: 0x%08x\n",
                    me->basicMsg._msgName, me->msgId, me->errorCode);

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _CBStatusPayloadMsg;

                /* Don't change the basicMsg name since we don't actually know what it is but add a
                 * status payload msg to let the user know the error. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;



                status_ = Q_TRAN(&CommMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&CommMgr_Busy);
            break;
        }
    }
    return status_;
}
/*${AOs::CommMgr::SM::Active::Busy::WaitForRespFromF~} .....................*/
static QState CommMgr_WaitForRespFromFlashMgr(CommMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::CommMgr::SM::Active::Busy::WaitForRespFromF~} */
        case Q_ENTRY_SIG: {
            QTimeEvt_rearm(                                       /* Re-arm timer on entry */
                &me->commOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_COMM_MSG_FLASH_OP )
            );

            me->errorCode = ERR_COMM_FLASHMGR_TIMEOUT; /* Set the error in case we timeout */
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Busy::WaitForRespFromF~} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm(&me->commOpTimerEvt);                  /* Disarm timer on exit */

